{"id":1,"name":"Weekly Meal Plan","householdId":1,"createdAt":"2025-04-29T18:59:15.959Z","isActive":true,"meals":[{"id":"meal-1747834748565-170","day":"Not specified","name":"One-Pot Creamy Tuscan Chicken Pasta with Roasted Red Peppers","category":"Weeknight Meals","prepTime":35,"servings":3,"categories":["Quick & Easy","Comfort Food","One-Pot"],"originalId":"meal-1747834748565-170","rationales":["Replacing sun-dried tomatoes with roasted red peppers maintains a similar sweet and smoky flavor profile, adding depth to the dish.","Roasted red peppers are widely available and complement the creamy sauce with their vibrant color and natural sweetness.","This substitution keeps the recipe easy to follow with readily accessible ingredients, perfect for a family-friendly weekday meal."],"description":"A hearty and comforting dish featuring tender chicken, spinach, and roasted red peppers in a creamy sauce, all cooked in one pot for easy cleanup and minimal fuss.","ingredients":["1 pound boneless chicken breasts, cut into 1-inch pieces","2 tablespoons olive oil","1 teaspoon salt, divided","1/2 teaspoon black pepper, divided","1 teaspoon Italian seasoning","3 cloves garlic, minced","1/2 cup roasted red peppers, chopped","3 cups chicken broth","1 cup heavy cream","8 ounces penne pasta","3 cups baby spinach leaves","1/2 cup grated Parmesan cheese","1 tablespoon chopped fresh basil for garnish"],"instructions":["Heat 2 tablespoons olive oil in a large pot over medium-high heat until shimmering. Add the chicken pieces, season with 1/2 teaspoon salt, 1/4 teaspoon black pepper, and 1 teaspoon Italian seasoning, and cook for 5-6 minutes until the chicken is golden brown and cooked through, reaching an internal temperature of 165°F.","Remove the chicken from the pot and transfer to a clean plate or bowl and transfer to a clean plate or bowl and set aside, keeping warm by covering loosely with aluminum foil, keeping warm by covering loosely with aluminum foil. In the same pot, add the minced garlic and chopped roasted red peppers. Sauté for 1-2 minutes until the garlic is fragrant and the peppers are slightly softened.","Pour in 3 cups chicken broth and 1 cup heavy cream, scraping up any browned bits from the bottom of the pot to deglaze. Bring the mixture to a gentle boil over medium heat.","Add 8 ounces penne pasta to the pot, ensuring the pasta is submerged in the liquid. Stir occasionally, cooking for 10-12 minutes until the pasta is al dente and has absorbed most of the liquid.","Reduce the heat to low and return the cooked chicken to the pot. Stir in 3 cups baby spinach, allowing it to wilt for about 2-3 minutes until bright green and tender.","Sprinkle 1/2 cup grated Parmesan cheese over the pasta and stir until the cheese is melted and the sauce is creamy and thickened.","Season with the remaining 1/2 teaspoon salt and 1/4 teaspoon black pepper, adjusting to taste as needed.","Remove the pot from the heat and garnish with 1 tablespoon chopped fresh basil, adding a fresh herbal note to the dish.","Let the pasta sit for 2-3 minutes to thicken slightly, allowing flavors to meld together beautifully.","Serve the creamy Tuscan chicken pasta hot, ensuring each portion includes a generous amount of chicken, pasta, and sauce."],"mealPrepTips":"Read the recipe before starting and prep all ingredients for smoother cooking.","modifiedFrom":"One-Pot Creamy Tuscan Chicken Pasta","mainIngredients":["1 pound boneless chicken breasts, cut into 1-inch pieces","2 tablespoons olive oil","1 teaspoon salt, divided","1/2 teaspoon black pepper, divided","1 teaspoon Italian seasoning","3 cloves garlic, minced","1/2 cup roasted red peppers, chopped","3 cups chicken broth","1 cup heavy cream","8 ounces penne pasta","3 cups baby spinach leaves","1/2 cup grated Parmesan cheese","1 tablespoon chopped fresh basil for garnish"],"modificationRequest":"Replace the sundried tomatoes with something else"},{"id":"meal-1747932232917-442","name":"15-Minute Teriyaki Chicken Stir-Fry","category":"Quick & Easy","prepTime":15,"servings":3,"categories":["Quick & Easy","Weeknight","Stir-Fry"],"rationales":["This meal provides a high-protein option for Chris on his GLP, ensuring he meets his dietary requirements.","The dish can be prepared in under 15 minutes, fitting perfectly within the family's time constraints for a quick weeknight meal.","With vibrant vegetables and a sweet sauce, it's likely to be appealing to Cece's picky palate while still satisfying the whole family."],"description":"A quick and flavorful stir-fry with tender chicken, vibrant vegetables, and a savory teriyaki sauce. Perfect for a fast weeknight dinner.","ingredients":["1 pound boneless, skinless chicken breasts, cut into 1-inch pieces","2 tablespoons vegetable oil","1/2 cup teriyaki sauce","1 red bell pepper, sliced","1 cup broccoli florets","1/2 cup snap peas","1 tablespoon minced garlic","1 teaspoon minced ginger","1 tablespoon sesame oil","1 tablespoon sesame seeds","3 cups cooked jasmine rice","1/4 teaspoon salt","1/4 teaspoon black pepper","2 green onions, sliced for garnish"],"instructions":["Heat 2 tablespoons vegetable oil in a large skillet over medium-high heat until shimmering, about 1-2 minutes.","Add 1 pound of chicken pieces to the skillet and season with 1/4 teaspoon salt and 1/4 teaspoon black pepper. Cook, stirring occasionally, until the chicken is browned and cooked through, reaching an internal temperature of 165°F, approximately 5-6 minutes.","Remove the chicken from the skillet and transfer to a clean plate or bowl and set aside, keeping warm by covering loosely with aluminum foil. Add 1 tablespoon sesame oil to the same skillet and allow it to heat for about 30 seconds.","Add 1 tablespoon minced garlic and 1 teaspoon minced ginger to the hot oil. Stir constantly until fragrant, about 30 seconds.","Add 1 sliced red bell pepper, 1 cup broccoli florets, and 1/2 cup snap peas to the skillet. Stir-fry for 3-4 minutes until the vegetables are tender-crisp and vibrant in color.","Return the cooked chicken to the skillet with the vegetables. Stir to combine all prepared ingredients in the bowl, gently folding together with a spatula until everything is evenly distributed thoroughly.","Pour 1/2 cup teriyaki sauce over the chicken and vegetables. Stir to coat everything evenly with the sauce, allowing it to heat through for about 2 minutes.","Sprinkle 1 tablespoon sesame seeds over the stir-fry, tossing gently to distribute them evenly throughout the dish.","Remove the skillet from heat and let it sit for a minute, allowing the flavors to meld together and the sauce to thicken slightly.","Serve the teriyaki chicken stir-fry over 3 cups of cooked jasmine rice, ensuring each serving has an even amount of chicken and vegetables.","Garnish each plate with sliced green onions and an additional sprinkle of sesame seeds for a fresh and nutty finish.","enjoy while hot, with your favorite beverage on the side for a complete dining experience the meal while it's hot, appreciating the balance of savory chicken, crunchy vegetables, and sweet teriyaki glaze."],"mealPrepTips":"Consider pre-chopping vegetables or using pre-cut ones to save time.","_qualityIssues":[],"mainIngredients":["1 pound boneless, skinless chicken breasts, cut into 1-inch pieces","2 tablespoons vegetable oil","1/2 cup teriyaki sauce","1 red bell pepper, sliced","1 cup broccoli florets","1/2 cup snap peas","1 tablespoon minced garlic","1 teaspoon minced ginger","1 tablespoon sesame oil","1 tablespoon sesame seeds","3 cups cooked jasmine rice","1/4 teaspoon salt","1/4 teaspoon black pepper","2 green onions, sliced for garnish"]},{"id":"meal-1747939415813-115","name":"Trader Joe's 15-Minute Protein-Packed Chicken Stir Fry","prepTime":15,"servings":3,"categories":["Quick & Easy","Weeknight"],"rationales":["This meal is protein-rich, making it ideal for Chris's dietary needs while remaining flavorful and simple.","Quick preparation using Trader Joe's ingredients fits the family's weekday time constraints and cooking skill level.","The vibrant veggies and mild soyaki sauce make it appealing for picky eaters like Cece."],"description":"A lightning-fast stir fry featuring chicken and vibrant veggies, perfect for a nutritious weekday meal. This dish combines the convenience of pre-packaged ingredients with bold flavors, ensuring satisfaction for all family members.","ingredients":["1 pound Trader Joe's pre-cooked grilled chicken strips","2 cups Trader Joe's frozen stir-fry vegetable mix","1 tablespoon Trader Joe's sesame oil","2 cloves garlic, minced","1 tablespoon fresh ginger, grated","3 tablespoons Trader Joe's soyaki sauce","1 tablespoon Trader Joe's low-sodium soy sauce","1/4 teaspoon Trader Joe's chili flakes","1 tablespoon Trader Joe's toasted sesame seeds","1/2 cup Trader Joe's instant jasmine rice","2 tablespoons water","1/4 teaspoon salt","1/4 teaspoon black pepper"],"instructions":["Heat 1 tablespoon sesame oil in a large non-stick skillet over medium-high heat until shimmering, about 2 minutes.","Add 2 cloves minced garlic and 1 tablespoon grated ginger to the skillet, sautéing until fragrant and golden, about 1 minute.","Add 2 cups frozen stir-fry vegetable mix to the skillet, stirring frequently until the vegetables are bright and tender, about 4 minutes.","Introduce 1 pound pre-cooked grilled chicken strips to the skillet, tossing to combine with vegetables, and heat through until steaming and uniformly warm, about 2 minutes.","Pour 3 tablespoons soyaki sauce and 1 tablespoon low-sodium soy sauce over the chicken and vegetable mixture, stirring to coat evenly.","Sprinkle 1/4 teaspoon chili flakes for a hint of heat, stirring them into the mix until well distributed.","Reduce heat to low and simmer for an additional 2 minutes to allow flavors to meld together.","Meanwhile, in a separate small pot, bring 1/2 cup instant jasmine rice and 2 tablespoons water to a boil, then cover and reduce to a simmer for 5 minutes.","Remove rice from heat and let it sit, covered, for an additional 2 minutes to absorb remaining moisture.","Fluff rice with a fork and season with 1/4 teaspoon salt and 1/4 teaspoon black pepper, ensuring grains are separate and tender.","Divide rice evenly among three plates, then top with chicken stir-fry mixture, ensuring equal distribution of sauce and ingredients.","Garnish each plate with 1 tablespoon toasted sesame seeds for added flavor and crunch before serving."],"_qualityIssues":[],"mainIngredients":["1 pound Trader Joe's pre-cooked grilled chicken strips","2 cups Trader Joe's frozen stir-fry vegetable mix","1 tablespoon Trader Joe's sesame oil","2 cloves garlic, minced","1 tablespoon fresh ginger, grated","3 tablespoons Trader Joe's soyaki sauce","1 tablespoon Trader Joe's low-sodium soy sauce","1/4 teaspoon Trader Joe's chili flakes","1 tablespoon Trader Joe's toasted sesame seeds","1/2 cup Trader Joe's instant jasmine rice","2 tablespoons water","1/4 teaspoon salt","1/4 teaspoon black pepper"]}]}